app/controllers/websites_controller.rb

  def index
    @websites = Website.all
---
SELECT "websites".* FROM "websites"

  def create
    @website = Website.new(website_params)
    respond_to do |format|
      if @website.save
---
INSERT INTO "websites" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "1"], ["created_at", "2015-09-01 04:10:22.143083"], ["updated_at", "2015-09-01 04:10:22.143083"]]

    def set_website
      @website = Website.find(params[:id])
---
SELECT  "websites".* FROM "websites" WHERE "websites"."id" = ? LIMIT 1  [["id", 1]]